# Introduction to the `pandas` data analysis library

We will use a Jupyter notebook for the final Python session of the Vorkurs, and introduce the `pandas` data analysis library.

Jupyter notebooks allow you to write Python code interactively in your browser, and display the code's intermediate outputs (text, tables or plots) in-place. Jupyter notebooks are structured into three kinds of cells:
1. Markdown text (like the one you're currently reading)
2. Code
3. Output

Code cells can be run one-by-one, as opposed to executing an entire Python program in one go. Code cells that you execute (with the `Run` button or `Ctrl+Enter`) have lasting effects: all the variables set by previously executed code cells will be available for later cells.

You can edit and re-run cells freely, but keep in mind that your program's internal state depends on what you had previously run, which isn't necessarily consistent with what you see on your screen. E.g. if you execute a cell containing `a = 1`, then change it to `b = 1` and re-run it: variable `a` won't disappear, it will still be available for later cells until you restart your session.

Upon the execution of a cell, the last line of the cell's code will be additionally printed and placed below the cell by default, which is a useful feature to inspect intermediate results. Try it by running this cell:

In [1]:
print("I can check stuff without explicit print statements like this")
a = 5
b = 3

a + b

I can check stuff without explicit print statements like this

8

The history saving thread hit an unexpected error (DatabaseError('database disk image is malformed')).History will not be written to the database.

You saw that running the code cell created an output cell below it. This is how we will use Jupyter notebooks and look at our intermediate outputs.

You can take a look at [Jupyter keyboard shortcuts](https://www.cheatography.com/weidadeyue/cheat-sheets/jupyter-notebook/) to help you format and interact with your notebooks efficiently. The important parts:

You can insert a new cell anywhere by clicking on the left margin of a cell, and pressing `b` (for below) or `a` (for above). If the left border of a cell is blue, you are in navigation mode. If it's green, you are in editing mode. You can switch between them with `Escape` and `Enter`. You can run a code cell with `Ctrl+Enter`. In nagivation mode, you can move between cells using the `Up` or `Down` keys.

In [2]:
# Try navigating, inserting, editing and executing code cells.

## Pandas

The purpose of this notebook is to give an introduction to the `pandas` data analysis library. `pandas` provides data structures and various kinds of operations for handling tabular data.

The basic object types are `Series` (1-dimensional data, like a list) and `DataFrame` (2-dimensional data, like a table). These objects have a lot of fancy features that plain old Python lists, or even `numpy` arrays don't. They offer label-based indexing, slicing, grouping, aggregation, merging, reshaping, pivoting, and a host of other manipulation methods, as well as some visualization capabilities using `matplotlib` or `seaborn`. DataFrames also support pretty HTML table outputs inside Jupyter notebooks by default.

Pandas has extensive online documentation, and you may find their [10 Minutes Introduction](http://pandas.pydata.org/pandas-docs/stable/10min.html) and their [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html) especially useful.

## Import pandas

Conventionally `pandas` is imported under the name `pd`. There are a few other conventions such as `numpy as np` or the visualization library `seaborn as sns`.

In [3]:
import pandas as pd

## Series objects

Create a pandas `Series` object named `s` with the following data:

|     |
|-----|
| 3.0 |
| 1.5 |
| 4.3 |
| 8.2 |
| 0.9 |

Now
* Access its first value
* Access its last value
* Calculate its mean and standard deviation
* Sort it in ascending and descending order

Use a separate code block for each operation.

In [4]:
s = pd.Series([3.0, 1.5, 4.3, 8.2, 0.9], name='s')
s

0    3.0
1    1.5
2    4.3
3    8.2
4    0.9
Name: s, dtype: float64

In [5]:
s.iloc[0]  # s.loc[0]

3.0

In [6]:
s.iloc[-1]  # s.loc[4]

0.9

In [7]:
s.mean(), s.std()

(3.5799999999999996, 2.90292955477738)

In [8]:
s2 = s.sort_values(ascending=False)
s2

3    8.2
2    4.3
0    3.0
1    1.5
4    0.9
Name: s, dtype: float64

Store the sorted `Series` in variable `s2`. Notice how the index labels moved together with the values. Positional (`.iloc[]`) and label-based (`.loc[]`) access behave very differently now, try them out!

In [9]:
s2.iloc[0], s2.loc[0]

(8.2, 3.0)

## DataFrame objects, accessing values

Create a `DataFrame` named `df_species` with the following data:

| |species |weight  |legs |
|--------|--|---|----|
|<b>0</b>|human |62  |2 |
|<b>1</b>|cat   |4  |4 |
|<b>2</b>|mouse |0.02  |4 |
|<b>3</b>|dog   |20 |4 |
|<b>4</b>|mole  |0.09  |4 |
|<b>5</b>|train |200000 |0 |
|<b>6</b>|bee   |0.0001 |6  |
|<b>7</b>|elephant |3000 |4 |

You can pass the data to the `DataFrame(...)` constructor column-by-column as a dictionary (keys: column labels, values: list of column values), or row-by-row using nested lists. In the latter case, you have to additionally specify the column labels using the `columns=` keyword argument.

In [10]:
df_species = pd.DataFrame([
    ['human', 62,   2],
    ['cat'  , 4,    4],
    ['mouse', 0.02, 4],
    ['dog'  , 20,   4],
    ['mole' , 0.09, 4],
    ['train', 200000, 0],
    ['bee'  , 0.0001, 6],
    ['elephant', 3000, 4],
], columns=['species', 'weight', 'legs'])

# OR

df_species = pd.DataFrame({
    'species': ['human', 'cat', 'mouse', 'dog', 'mole', 'train', 'bee', 'elephant'],
    'weight': [62, 4, 0.02, 20, 0.09, 200000, 0.0001, 3000],
    'legs': [2, 4, 4, 4, 4, 0, 6, 4]
})

df_species

    species       weight  legs
0     human      62.0000     2
1       cat       4.0000     4
2     mouse       0.0200     4
3       dog      20.0000     4
4      mole       0.0900     4
5     train  200000.0000     0
6       bee       0.0001     6
7  elephant    3000.0000     4

Now, in separate cells
* access the 3rd row of `df_species`. What type is the resulting object?
* access the row with index `3`
* access the column `weight`
* access a single cell (e.g. dog's number of legs)
* print the index and column labels
* extract rows 2-5 into a new DataFrame (no need to save it)
* obtain a summary table of the DataFrame with the means, standard deviations, min/max/percentiles of the numerical columns
* add a new column `weight_in_lb` to the DataFrame containing the weights in pounds instead of kilograms

In [11]:
print(type(df_species.iloc[2]))
df_species.iloc[2]

<class 'pandas.core.series.Series'>

species    mouse
weight      0.02
legs           4
Name: 2, dtype: object

In [12]:
df_species.loc[3]

species    dog
weight      20
legs         4
Name: 3, dtype: object

In [13]:
df_species['weight']
# OR
df_species.loc[:, 'weight']

0        62.0000
1         4.0000
2         0.0200
3        20.0000
4         0.0900
5    200000.0000
6         0.0001
7      3000.0000
Name: weight, dtype: float64

In [14]:
df_species.loc[3, 'legs']

4

In [15]:
print(df_species.index)
print(df_species.index.tolist())
print()
print(df_species.columns)

RangeIndex(start=0, stop=8, step=1)
[0, 1, 2, 3, 4, 5, 6, 7]

Index(['species', 'weight', 'legs'], dtype='object')

In [16]:
df_species.iloc[1:6]  # position-based indexing: end NOT included
# OR
df_species.loc[1:5]  # label-based indexing: end IS included

  species     weight  legs
1     cat       4.00     4
2   mouse       0.02     4
3     dog      20.00     4
4    mole       0.09     4
5   train  200000.00     0

In [17]:
df_species.describe()

              weight      legs
count       8.000000  8.000000
mean    25385.763762  3.500000
std     70562.543935  1.772811
min         0.000100  0.000000
25%         0.072500  3.500000
50%        12.000000  4.000000
75%       796.500000  4.000000
max    200000.000000  6.000000

In [18]:
# Series can be treated as vectors, and be multiplied, added, etc. with the usual operators
df_species['weight_in_lb'] = df_species['weight'] * 2.2

# Alternative if you don't want to do it in-place, but want to get a new DF with the inserted column:
# df_species.assign(weight_in_lb=(df_species['weight'] * 2.2))

## Data Import

Import the `df_characters.csv` file into a DataFrame named `df`, and display it:

In [19]:
df = pd.read_csv('../example_data/df_characters.csv')
df

                   name country   species       weight  birthyear
0               Pumuckl     GER    kobold       2.0000       1982
1                   Tom     USA       cat       3.0000       1940
2                 Jerry     USA     mouse       0.3000       1940
3          Mickey Mouse     USA     mouse      10.0000       1928
4               Asterix     FRA     human      58.0000       1959
5                Obelix     FRA     human     180.0000       1959
6           Hello Kitty     JPN       cat       0.7000       1974
7               Songoku     JPN     human      62.0000       1984
8        Maulwurf Krtek     CZE      mole       0.1000       1956
9                Tintin     BEL     human      54.0000       1929
10               Thomas     GBR     train  115000.0000       1984
11           Biene Maja     GER       bee       0.0001       1975
12                 Gary     USA     snail       0.0500       1999
13                Babar     CAN  elephant    2000.0000       1989
14    Benjamin Blümchen     GER  elephant     800.0000       1988
15  Prinzessin Lillifee     GER     human      30.0000       2004

Now import the file `df_countries.tsv` into a pandas DataFrame as `df_countries`. Do you need to change any parameters of the importing function?

In [20]:
df_countries = pd.read_csv('../example_data/df_countries.tsv', sep='\t')
df_countries

  code              country_name continent  population
0  GER                   Germany    Europe        83.0
1  USA  United States of America   America       327.0
2  FRA                    France    Europe        67.0
3  JPN                     Japan      Asia       127.0
4  CZE            Czech Republic    Europe        10.5
5  BEL                   Belgium    Europe        11.3
6  GBR            United Kingdom    Europe        66.0
7  CHN                     China      Asia      1386.0
8  CAN                    Canada   America        37.0
9  BRA                    Brazil   America       210.0

## DataFrame filtering

The DataFrame access method `.loc[]` can take:
* individual index labels (as seen previously)
* lists of index labels
* slices in the `beginning:end` format (also seen previously)
* boolean valued `Series` objects, where only labels with `True` value are kept

For the upcoming task, the last method will be especially useful. Using the cartoon character DataFrame `df`, filter them for the following criteria (separately) and display the results:

* German characters
* Characters born after 1970
* Human characters weighing <60 kg

Tips: You can perform boolean comparisons for an entire `Series` with the usual `>`, `<`, `==`, `!=` etc operators. You can do elementwise logical operations between two conforming `Series` objects using the `&` or `|` operators.

In [21]:
df.loc[df['country']=='GER']

# Some may do it without loc:
df[df['country']=='GER']
# Direct brackets are "smart" and will check whether the passed Series index matches rows or columns.
# Both are fine, although .loc[] is more explicit.

                   name country   species    weight  birthyear
0               Pumuckl     GER    kobold    2.0000       1982
11           Biene Maja     GER       bee    0.0001       1975
14    Benjamin Blümchen     GER  elephant  800.0000       1988
15  Prinzessin Lillifee     GER     human   30.0000       2004

In [22]:
df.loc[(df.species=='human') & (df.weight < 60)]

# You can show the query function at this point:

df.query('species=="human" & weight < 60')

                   name country species  weight  birthyear
4               Asterix     FRA   human    58.0       1959
9                Tintin     BEL   human    54.0       1929
15  Prinzessin Lillifee     GER   human    30.0       2004

Introduce a new column named `age` based on the characters' birthdates. Answer the following questions:

* What is the average age of the characters?
* Who is the youngest German character?

In [23]:
df['age'] = 2020 - df['birthyear']

In [24]:
df.loc[df['country'] == 'GER']['age'].mean()

32.75

In [25]:
df.loc[df['country']=='GER'].sort_values('age').iloc[0]

# OR

df2 = df.query('country == "GER"')
df2.loc[df2['age'].idxmin()]
df2.loc[df2['age'] == df2['age'].min()]

                   name country species  weight  birthyear  age
15  Prinzessin Lillifee     GER   human    30.0       2004   16

## DataFrame aggregation

Using the same DataFrame `df`
* Count the number of characters from each country
* Calculate the average weight and age of characters by species
* List the heaviest characters per country

In [26]:
df.country.value_counts()

# OR

df.groupby('country').size()

# notice that the Series index labels are the group keys (country codes) instead of integers.

country
BEL    1
CAN    1
CZE    1
FRA    2
GBR    1
GER    4
JPN    2
USA    4
dtype: int64

In [27]:
df.groupby('species').mean()[['weight', 'age']]
# Same thing, DF index labels are group keys now.

               weight   age
species
bee            0.0001  45.0
cat            1.8500  63.0
elephant    1400.0000  31.5
human         76.8000  53.0
kobold         2.0000  38.0
mole           0.1000  64.0
mouse          5.1500  86.0
snail          0.0500  21.0
train     115000.0000  36.0

In [28]:
df.sort_values('weight', ascending=False).groupby('country').first()

# OR

heaviest_in_country = df.groupby('country').weight.idxmax()
df.loc[heaviest_in_country]

# OR

is_heaviest_of_country = df.groupby('country').weight.transform(max) == df.weight
df.loc[is_heaviest_of_country]

# OR

def get_heaviest(input_df):
    return input_df.sort_values('weight').iloc[-1]
df.groupby('country').apply(get_heaviest)

                      name country   species    weight  birthyear  age
country
BEL                 Tintin     BEL     human      54.0       1929   91
CAN                  Babar     CAN  elephant    2000.0       1989   31
CZE         Maulwurf Krtek     CZE      mole       0.1       1956   64
FRA                 Obelix     FRA     human     180.0       1959   61
GBR                 Thomas     GBR     train  115000.0       1984   36
GER      Benjamin Blümchen     GER  elephant     800.0       1988   32
JPN                Songoku     JPN     human      62.0       1984   36
USA           Mickey Mouse     USA     mouse      10.0       1928   92

## Merging DataFrames

By combining information from the DataFrames above we can try to answer more complex queries. For example, the number of legs for a given character isn't stored in the `df` DataFrame, but it is available in the `df_species` DataFrame if we look up the corresponding entry of the character's species. If we could combine the two into a single DataFrame, we could create queries using character-specific **and** species-specific data at the same time.

Combining tables based on shared keys is called merging. Pandas allows you to do it with either the function `pd.merge` or as a DataFrame method `df.merge`. All you have to do is specify the two DataFrames that you want to merge (the first one is already implied if you use it as a method) and the column label(s) that you want to merge them on.

Merge `df` and `df_species` into a new DataFrame named `dfm` and answer the following questions:

* What is the average age of four-legged characters?

In [29]:
dfm = pd.merge(df, df_species, on='species')
# OR
dfm = df.merge(df_species, on='species')


dfm.loc[dfm['legs']==4]['age'].mean()

60.714285714285715

* What is the average weight of four-legged characters?

Although the question sounds nearly identical to the previous one, you may notice that something happened to your original character `weight` column. Since the column name was contained in both DataFrames, they had to be renamed during the merge to avoid a collision. You can control how to rename them with the `suffixes` keyword argument. We suggest that you set them to `_indiv` and `_species` so you can distinguish `weight_indiv` (the character's weight) from `weight_species` (their species' typical weight).

In [30]:
dfm = df.merge(df_species, on='species', suffixes=['_indiv', '_species'])
dfm.loc[dfm['legs']==4]['weight_indiv'].mean()

402.0142857142857

* Has any character gone missing during the merge?

Why is that? How could you ensure that they aren't thrown out? Hint: the `merge` function/method has a keyword argument `how`. You can either go back to the cell where you created `dfm` and update it, or you can overwrite `dfm` here.

In [31]:
# Pumuckl and Gary are missing, they have no species entry in df_species
dfm = df.merge(df_species, on='species', suffixes=['_indiv', '_species'], how='left')
dfm

,name,country,species,weight_indiv,birthyear,age,weight_species,legs,weight_in_lb
0,Pumuckl,GER,kobold,2.0000,1982,38,NaN,NaN,NaN
1,Tom,USA,cat,3.0000,1940,80,4.0000,4.0,8.80000
2,Jerry,USA,mouse,0.3000,1940,80,0.0200,4.0,0.04400
3,Mickey Mouse,USA,mouse,10.0000,1928,92,0.0200,4.0,0.04400
4,Asterix,FRA,human,58.0000,1959,61,62.0000,2.0,136.40000
5,Obelix,FRA,human,180.0000,1959,61,62.0000,2.0,136.40000
6,Hello Kitty,JPN,cat,0.7000,1974,46,4.0000,4.0,8.80000
7,Songoku,JPN,human,62.0000,1984,36,62.0000,2.0,136.40000
8,Maulwurf Krtek,CZE,mole,0.1000,1956,64,0.0900,4.0,0.19800
9,Tintin,BEL,human,54.0000,1929,91,62.0000,2.0,136.40000
10,Thomas,GBR,train,115000.0000,1984,36,200000.0000,0.0,440000.00000
11,Biene Maja,GER,bee,0.0001,1975,45,0.0001,6.0,0.00022
12,Gary,USA,snail,0.0500,1999,21,NaN,NaN,NaN
13,Babar,CAN,elephant,2000.0000,1989,31,3000.0000,4.0,6600.00000
14,Benjamin Blümchen,GER,elephant,800.0000,1988,32,3000.0000,4.0,6600.00000
15,Prinzessin Lillifee,GER,human,30.0000,2004,16,62.0000,2.0,136.40000

* Compute the characters' relative weight as a ratio of the typical weight of their species, and add it as a new column `rel_weight`.

Of course you won't be able to calculate that for characters whose species data wasn't available. But that's okay, `pandas` can handle operations with missing values wisely.

In [32]:
dfm['rel_weight'] = dfm['weight_indiv'] / dfm['weight_species'] * 100
dfm

,name,country,species,weight_indiv,birthyear,age,weight_species,legs,weight_in_lb,rel_weight
0,Pumuckl,GER,kobold,2.0000,1982,38,NaN,NaN,NaN,NaN
1,Tom,USA,cat,3.0000,1940,80,4.0000,4.0,8.80000,75.000000
2,Jerry,USA,mouse,0.3000,1940,80,0.0200,4.0,0.04400,1500.000000
3,Mickey Mouse,USA,mouse,10.0000,1928,92,0.0200,4.0,0.04400,50000.000000
4,Asterix,FRA,human,58.0000,1959,61,62.0000,2.0,136.40000,93.548387
5,Obelix,FRA,human,180.0000,1959,61,62.0000,2.0,136.40000,290.322581
6,Hello Kitty,JPN,cat,0.7000,1974,46,4.0000,4.0,8.80000,17.500000
7,Songoku,JPN,human,62.0000,1984,36,62.0000,2.0,136.40000,100.000000
8,Maulwurf Krtek,CZE,mole,0.1000,1956,64,0.0900,4.0,0.19800,111.111111
9,Tintin,BEL,human,54.0000,1929,91,62.0000,2.0,136.40000,87.096774
10,Thomas,GBR,train,115000.0000,1984,36,200000.0000,0.0,440000.00000,57.500000
11,Biene Maja,GER,bee,0.0001,1975,45,0.0001,6.0,0.00022,100.000000
12,Gary,USA,snail,0.0500,1999,21,NaN,NaN,NaN,NaN
13,Babar,CAN,elephant,2000.0000,1989,31,3000.0000,4.0,6600.00000,66.666667
14,Benjamin Blümchen,GER,elephant,800.0000,1988,32,3000.0000,4.0,6600.00000,26.666667
15,Prinzessin Lillifee,GER,human,30.0000,2004,16,62.0000,2.0,136.40000,48.387097

Now let's answer some queries based on the characters' countries of origin:
* How many characters are there from each continent?
* Which character comes from the smallest country?

For this you have to merge `df` and `df_countries` (let's call the result `dfm2`). There's one little issue: the shared key is labelled differently in the two DataFrames. Thankfully the `merge` function/method allows you to specify them independently for the left and right DataFrame if necessary.

In [33]:
dfm2 = df.merge(df_countries, left_on='country', right_on='code')
# Warning: If they do it the other way around, the country code column will be named "code" instead of "country"
dfm2.groupby('continent').size()

continent
America    5
Asia       2
Europe     9
dtype: int64

In [34]:
dfm2.sort_values('population').iloc[0]

# OR

dfm2.loc[dfm2.population == dfm2.population.min()]

,name,country,species,weight,birthyear,age,code,country_name,continent,population
12,Maulwurf Krtek,CZE,mole,0.1,1956,64,CZE,Czech Republic,Europe,10.5

And finally, a question that requires information from all three DataFrames:

* Who is the most overweight European character?

You can't directly merge three DataFrames with a single operation, but you can merge `dfm` with `df_countries` easily enough. Let's call this resulting "mega-merge" as `df_all`.

In [35]:
df_all = dfm.merge(df_countries, left_on='country', right_on='code', how='left')
df_all.loc[df_all['continent']=='Europe'].sort_values('rel_weight', ascending=False).iloc[0]

# OR

df_eu = df_all.loc[df_all.continent=='Europe']
df_eu.loc[df_eu.rel_weight.idxmax()]

name               Obelix
country               FRA
species             human
weight_indiv          180
birthyear            1959
age                    61
weight_species         62
legs                    2
weight_in_lb        136.4
rel_weight        290.323
code                  FRA
country_name       France
continent          Europe
population             67
Name: 5, dtype: object

### Group filtering

You can either continue working with `df` or `df_all`, it won't matter for the next task:

* List characters that are the sole entries of their country

To answer this question, you can use the `filter` method of `GroupBy` objects. It is similar to the aggregation methods like `mean`, `size` or `first` that we had used before, but instead of returning a single row per group, it either returns all rows of the group or none of them.

It expects a simple function as an argument. The function's input will be a DataFrame containing all rows of a group, and it should return a boolean `True/False` value. If the returned value is `True`, the group will be kept, otherwise it will be discarded.

Of course you can experiment with alternative solutions too!

In [36]:
df.groupby('country').filter(lambda x: len(x)==1)

# non-filter solutions:
df.drop_duplicates(subset='country', keep=False)

# ugly but logical:
chars_per_country = df.groupby('country').size()
countries_w_1 = [country for country, numchars in chars_per_country.items() if numchars==1]
df.loc[df['country'].isin(countries_w_1)]

              name country   species    weight  birthyear  age
8   Maulwurf Krtek     CZE      mole       0.1       1956   64
9           Tintin     BEL     human      54.0       1929   91
10          Thomas     GBR     train  115000.0       1984   36
13           Babar     CAN  elephant    2000.0       1989   31

### Grouping using derived keys

* Count characters by decade of birth -- without inserting a new column!

So far, we have always used a column label as `groupby`'s argument. If we wanted to group rows based on data that isn't explicitly contained in the DataFrame, we would've had to insert a new column with the data, and group by that new column.

Thankfully, `groupby` also accepts a `Series` object as an argument, and group the DataFrame according to the values of that Series, without having to insert that Series into the DataFrame.

Hint: you can round a number down to the nearest ten with the full division operator by `x // 10 * 10`.

In [37]:
df.groupby(df.birthyear // 10 * 10).size()

birthyear
1920    2
1940    2
1950    3
1970    2
1980    5
1990    1
2000    1
dtype: int64

## Data export

Export `df_all` into `characters_merged.tsv` in tab-separated format with question marks in place of N/A values, and omit the index column.

In [38]:
df_all.to_csv('characters_merged.tsv', sep='\t', index=False, na_rep='?')